[
    {
        "id": 1,
        "text": "Whiskers, a curious cat, discovers a hidden, magical garden behind her home. Inside the garden are two paths: one leads through a flower path, the other into a shady grove.  Which path should Whiskers take?",
        "image": "1.png",
        "choices": [
            {
                "text": "flower path",
                "next": 2
            },
            {
                "text": "shady grove",
                "next": 3
            }
        ]
    },
    {
        "id": 2,
        "text": "Along the flower path are talking flowers, each with their own stories! Whiskers meets a confused daisy and a sunflower seeking the perfect sunlight. Which flower should Whiskers help?",
        "image": "2.png",
        "choices": [
            {
                "text": "confused daisy",
                "next": 4
            },
            {
                "text": "sunbathing sunflower",
                "next": 5
            }
        ]
    },
    {
        "id": 3,
        "text": "In the shady grove, Whiskers finds ancient trees and playful shadows! She encounters an old oak tree with a riddle and mysterious shadows inviting her to a game. What should Whiskers do?",
        "image": "3.png",
        "choices": [
            {
                "text": "solve the riddle",
                "next": 6
            },
            {
                "text": "play with shadows",
                "next": 7
            }
        ]
    },
    {
        "id": 4,
        "text": "Whiskers helps the daisy remember its song, uncovering a hidden key beneath its petals. Suddenly, a magical storm begins. Should Whiskers seek shelter or head back towards home?",
        "image": "4.png",
        "choices": [
            {
                "text": "seek shelter",
                "next": 8
            },
            {
                "text": "return home",
                "next": 9
            }
        ]
    },
    {
        "id": 5,
        "text": "Helping the sunflower find sunlight reveals a secret passage behind its stalk. As Whiskers explores, a magical storm brews. Does Whiskers seek shelter or return home?",
        "image": "5.png",
        "choices": [
            {
                "text": "seek shelter",
                "next": 8
            },
            {
                "text": "return home",
                "next": 9
            }
        ]
    },
    {
        "id": 6,
        "text": "Whiskers solves the oak tree's riddle, unlocking a hidden drawer with an ancient map of the garden! But a storm is brewing in the distance, and Whiskers will have to continue exploring another day! Help Whiskers choose: should she find shelter here in the forest or return home?",
        "image": "6.png",
        "choices": [
            {
                "text": "seek shelter",
                "next": 8
            },
            {
                "text": "return home",
                "next": 9
            }
        ]
    },
    {
        "id": 7,
        "text": "Playing with the shadows, Whiskers finds a buried treasure. As a storm approaches, should Whiskers hide in a log or go back to the entrance?",
        "image": "7.png",
        "choices": [
            {
                "text": "seek shelter",
                "next": 8
            },
            {
                "text": "return to entrance",
                "next": 9
            }
        ]
    },
    {
        "id": 8,
        "text": "Whiskers finds shelter in a log, meeting a wise hedgehog with tales of the garden. The storm passes, leaving Whiskers with new stories to tell.",
        "image": "8.png",
        "choices": [
            {
                "text": "continue",
                "next": 10
            }
        ]
    },
    {
        "id": 9,
        "text": "Whiskers returns to the entrance, finding a magical item left as a token of appreciation from the garden. Whiskers decides it's time to heads home, enriched by the day's adventures.",
        "image": "9.png",
        "choices": [
            {
                "text": "continue",
                "next": 10
            }
        ]
    },
    {
        "id": 10,
        "text": "",
        "image": "10.png",
        "choices": []
    }
]